MOVE SPACES TO WS-OUTPUT-RECORD.

MOVE 'ABC' TO WS-INPUT-FIELD.

IF WS-INPUT-FIELD = 'ABC' THEN
    MOVE 'Match' TO WS-OUTPUT-RECORD
ELSE
    MOVE 'No Match' TO WS-OUTPUT-RECORD
END-IF.

DISPLAY WS-OUTPUT-RECORD.